; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=61, remove_proportion=0.101, bases=24, instance_id=18, output=./training, seed=59

(define (problem warehouse-18)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 box25 box26 box27 box28 box29 box30 box31 box32 box33 box34 box35 box36 box37 box38 box39 box40 box41 box42 box43 box44 box45 box46 box47 box48 box49 box50 box51 box52 box53 box54 box55 box56 box57 box58 box59 box60 box61 - box
        base1 base2 base3 base4 base5 base6 base7 base8 base9 base10 base11 base12 base13 base14 base15 base16 base17 base18 base19 base20 base21 base22 base23 base24 - base
    )
    (:init
        (to-remove box2)
        (to-remove box6)
        (to-remove box9)
        (to-remove box15)
        (to-remove box30)
        (to-remove box42)
        (clear box6)
        (on box6 box3)
        (on box3 box48)
        (on-base box48 base1)
        (clear box27)
        (on box27 box23)
        (on-base box23 base2)
        (clear box26)
        (on box26 box30)
        (on box30 box33)
        (on box33 box36)
        (on box36 box49)
        (on-base box49 base3)
        (clear box19)
        (on box19 box20)
        (on box20 box42)
        (on-base box42 base4)
        (clear box45)
        (on-base box45 base5)
        (clear box12)
        (on box12 box17)
        (on-base box17 base6)
        (clear box28)
        (on-base box28 base7)
        (clear box54)
        (on-base box54 base8)
        (clear box34)
        (on-base box34 base9)
        (clear box60)
        (on box60 box1)
        (on box1 box35)
        (on box35 box51)
        (on box51 box11)
        (on box11 box25)
        (on-base box25 base10)
        (clear box15)
        (on box15 box55)
        (on box55 box43)
        (on box43 box24)
        (on-base box24 base11)
        (clear box21)
        (on-base box21 base12)
        (clear box58)
        (on box58 box47)
        (on box47 box8)
        (on-base box8 base13)
        (clear-base base14)
        (clear box50)
        (on-base box50 base15)
        (clear box9)
        (on box9 box7)
        (on-base box7 base16)
        (clear box18)
        (on box18 box53)
        (on box53 box56)
        (on-base box56 base17)
        (clear box52)
        (on box52 box10)
        (on-base box10 base18)
        (clear box44)
        (on box44 box31)
        (on box31 box14)
        (on box14 box38)
        (on-base box38 base19)
        (clear box5)
        (on box5 box32)
        (on box32 box61)
        (on box61 box41)
        (on-base box41 base20)
        (clear box40)
        (on box40 box22)
        (on-base box22 base21)
        (clear box16)
        (on box16 box37)
        (on box37 box57)
        (on box57 box46)
        (on box46 box4)
        (on-base box4 base22)
        (clear box2)
        (on-base box2 base23)
        (clear box39)
        (on box39 box29)
        (on box29 box13)
        (on box13 box59)
        (on-base box59 base24)
    )
    (:goal (and 
        (removed box2)
        (removed box6)
        (removed box9)
        (removed box15)
        (removed box30)
        (removed box42)
    ))
)

; plan
1. (move box19 box20 box12)
   deleted: (clear box12) (on box19 box20)
   added: (on box19 box12) (clear box20)
   goals met: 0 of 6
2. (remove box15 box55)
   deleted: (on box15 box55) (clear box15)
   added: (removed box15) (clear box55)
   goals met: 1 of 6
3. (move box20 box42 box16)
   deleted: (clear box16) (on box20 box42)
   added: (on box20 box16) (clear box42)
   goals met: 1 of 6
4. (move box26 box30 box18)
   deleted: (clear box18) (on box26 box30)
   added: (on box26 box18) (clear box30)
   goals met: 1 of 6
5. (remove-from-base box2 base23)
   deleted: (on-base box2 base23) (clear box2)
   added: (removed box2) (clear-base base23)
   goals met: 2 of 6
6. (remove box30 box33)
   deleted: (on box30 box33) (clear box30)
   added: (removed box30) (clear box33)
   goals met: 3 of 6
7. (remove-from-base box42 base4)
   deleted: (on-base box42 base4) (clear box42)
   added: (removed box42) (clear-base base4)
   goals met: 4 of 6
8. (remove box6 box3)
   deleted: (on box6 box3) (clear box6)
   added: (removed box6) (clear box3)
   goals met: 5 of 6
9. (remove box9 box7)
   deleted: (on box9 box7) (clear box9)
   added: (removed box9) (clear box7)
   goals met: 6 of 6
